Revit 2024 API
Space.WallReflectance Property
Get or set the Wall Reflectance of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double WallReflectance { get; set; }
Visual Basic
Public Property WallReflectance As Double
	Get
	Set
Visual C++
public:
property double WallReflectance {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Wall Reflectance of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace